reports/benchmark/inspur_MetaX_C550/MiniMax-M2.5-W8A8/test_02/01/4-100-i194560-o1024/bench-test_02-4-100-i194560-o1024.log
Skipping import of cpp extensions due to incompatible torch version 2.8.0+metax3.5.3.9 for torchao version 0.15.0             Please see https://github.com/pytorch/ao/issues/2919 for more info
/opt/conda/lib/python3.10/site-packages/torchvision/datapoints/__init__.py:12: UserWarning: The torchvision.datapoints and torchvision.transforms.v2 namespaces are still Beta. While we do not expect major breaking changes, some APIs may still change according to user feedback. Please submit any feedback you may have in this issue: https://github.com/pytorch/vision/issues/6753, and you can also check out https://github.com/pytorch/vision/issues/7319 to learn more about the APIs that we suspect might involve future changes. You can silence this warning by calling torchvision.disable_beta_transforms_warning().
  warnings.warn(_BETA_TRANSFORMS_WARNING)
/opt/conda/lib/python3.10/site-packages/torchvision/transforms/v2/__init__.py:54: UserWarning: The torchvision.datapoints and torchvision.transforms.v2 namespaces are still Beta. While we do not expect major breaking changes, some APIs may still change according to user feedback. Please submit any feedback you may have in this issue: https://github.com/pytorch/vision/issues/6753, and you can also check out https://github.com/pytorch/vision/issues/7319 to learn more about the APIs that we suspect might involve future changes. You can silence this warning by calling torchvision.disable_beta_transforms_warning().
  warnings.warn(_BETA_TRANSFORMS_WARNING)
benchmark_args=Namespace(backend='sglang', base_url=None, host='0.0.0.0', port=8000, dataset_name='random', dataset_path='/home/workspace/ShareGPT_V3_unfiltered_cleaned_split.json', model=None, served_model_name=None, tokenizer=None, num_prompts=100, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=194560, random_output_len=1024, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=4, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None, rampup_mode=False, ramp_up_period=0.0)
Namespace(backend='sglang', base_url=None, host='0.0.0.0', port=8000, dataset_name='random', dataset_path='/home/workspace/ShareGPT_V3_unfiltered_cleaned_split.json', model='/data/data_shared/MiniMax-M2.5-W8A8', served_model_name=None, tokenizer=None, num_prompts=100, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=194560, random_output_len=1024, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=4, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None, rampup_mode=False, ramp_up_period=0.0)

#Input tokens: 19456000
#Output tokens: 102400
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...

  0%|          | 0/100 [00:00<?, ?it/s]
  1%|          | 1/100 [04:57<8:10:58, 297.56s/it]
  5%|▌         | 5/100 [09:54<2:50:17, 107.56s/it]
  9%|▉         | 9/100 [14:52<2:15:31, 89.36s/it] 
 13%|█▎        | 13/100 [19:49<2:00:02, 82.79s/it]
 17%|█▋        | 17/100 [19:50<1:10:24, 50.89s/it]
 18%|█▊        | 18/100 [20:10<1:09:33, 50.89s/it]
 19%|█▉        | 19/100 [24:47<1:37:12, 72.01s/it]
 23%|██▎       | 23/100 [29:44<1:33:31, 72.88s/it]
 27%|██▋       | 27/100 [34:42<1:29:19, 73.41s/it]
 31%|███       | 31/100 [39:39<1:24:48, 73.74s/it]
 35%|███▌      | 35/100 [39:41<54:07, 49.95s/it]  
 36%|███▌      | 36/100 [44:36<1:20:26, 75.41s/it]
 40%|████      | 40/100 [49:33<1:15:00, 75.01s/it]
 44%|████▍     | 44/100 [54:31<1:09:49, 74.80s/it]
 48%|████▊     | 48/100 [59:28<1:04:41, 74.65s/it]
 52%|█████▏    | 52/100 [1:04:26<59:39, 74.57s/it]
 56%|█████▌    | 56/100 [1:09:23<54:36, 74.47s/it]
 60%|██████    | 60/100 [1:14:21<49:38, 74.47s/it]
 64%|██████▍   | 64/100 [1:19:19<44:40, 74.45s/it]
 68%|██████▊   | 68/100 [1:24:16<39:41, 74.42s/it]
 72%|███████▏  | 72/100 [1:24:17<24:12, 51.89s/it]
 73%|███████▎  | 73/100 [1:29:13<34:07, 75.82s/it]
 77%|███████▋  | 77/100 [1:34:11<28:52, 75.32s/it]
 81%|████████  | 81/100 [1:39:09<23:45, 75.01s/it]
 85%|████████▌ | 85/100 [1:44:06<18:42, 74.80s/it]
 89%|████████▉ | 89/100 [1:49:04<13:41, 74.67s/it]
 93%|█████████▎| 93/100 [1:54:01<08:42, 74.58s/it]
 97%|█████████▋| 97/100 [1:58:58<03:43, 74.50s/it]
100%|██████████| 100/100 [1:58:58<00:00, 71.39s/it]

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 4         
Successful requests:                     100       
Benchmark duration (s):                  7138.91   
Total input tokens:                      19456000  
Total input text tokens:                 19456000  
Total generated tokens:                  102400    
Total generated tokens (retokenized):    98664     
Request throughput (req/s):              0.01      
Input token throughput (tok/s):          2725.34   
Output token throughput (tok/s):         14.34     
Peak output token throughput (tok/s):    93.00     
Peak concurrent requests:                8         
Total token throughput (tok/s):          2739.69   
Concurrency:                             4.00      
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   285550.39 
Median E2E Latency (ms):                 297529.83 
P90 E2E Latency (ms):                    297678.91 
P99 E2E Latency (ms):                    297902.96 
---------------Time to First Token----------------
Mean TTFT (ms):                          151789.54 
Median TTFT (ms):                        126783.24 
P99 TTFT (ms):                           252746.14 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          130.75    
Median TPOT (ms):                        105.27    
P99 TPOT (ms):                           228.93    
---------------Inter-Token Latency----------------
Mean ITL (ms):                           136.17    
Median ITL (ms):                         43.91     
P95 ITL (ms):                            44.19     
P99 ITL (ms):                            46.66     
Max ITL (ms):                            189451.02 
==================================================